test/integration/helpers/fixtures/payment-search.json

[
    {
        "scope": "https://api.railz.io:443",
        "method": "POST",
        "path": "/v1/recipients",
        "body": {
            "type": "individual",
            "firstName": "Tom",
            "lastName": "Jones",
            "email": "testEmail@example.com",
            "address": {
                "street1": "123 Wolfstrasse",
                "city": "Berlin",
                "country": "DE",
                "postalCode": "123123"
            }
        },
        "status": 200,
        "response": {
            "ok": true,
            "recipient": {
                "id": "R-PoY7FWr6yeyEY1635E47HL",
                "referenceId": "R-PoY7FWr6yeyEY1635E47HL",
                "parentRecipientId": null,
                "email": "testEmail@example.com",
                "name": "Tom Jones",
                "lastName": "Jones",
                "firstName": "Tom",
                "legalName": "",
                "type": "individual",
                "status": "incomplete",
                "language": "en",
                "complianceStatus": "pending",
                "dob": null,
                "passport": "",
                "placeOfBirth": null,
                "updatedAt": "2022-10-26T03:32:51.177Z",
                "createdAt": "2022-10-26T03:32:51.177Z",
                "tags": [],
                "isPortalUser": false,
                "taxDeliveryType": "mail",
                "contactEmails": [],
                "occupation": "",
                "address": {
                    "street1": "123 Wolfstrasse",
                    "street2": "",
                    "city": "Berlin",
                    "postalCode": "123123",
                    "country": "DE",
                    "region": null,
                    "phone": "",
                    "phoneValidated": false
                },
                "compliance": {
                    "status": "pending",
                    "checkedAt": null
                },
                "gravatarUrl": "https://www.gravatar.com/avatar/47891e3b30e9fe3c5355801d4cbd5896?d=404",
                "governmentId": null,
                "ssn": null,
                "governmentIds": [],
                "birthplace": {
                    "country": null,
                    "region": null,
                    "city": null
                },
                "citizenships": [],
                "routeType": "sepa",
                "routeMinimum": "0",
                "estimatedFees": "4",
                "accounts": [],
                "payoutMethod": null,
                "primaryCurrency": null,
                "riskScore": null,
                "merchantId": "M-W3mQuLjDafUGietRUqmeRz",
                "inactiveReasons": {
                    "primaryAccount": "missing"
                },
                "taxWithholdingPercentage": null,
                "taxForm": null,
                "taxFormStatus": null
            }
        },
        "rawHeaders": [
            "Date",
            "Wed, 26 Oct 2022 03:32:51 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1626",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "74",
            "X-Rate-Limit-Reset",
            "1666755231",
            "Vary",
            "Origin",
            "ETag",
            "W/\"65a-Eo/QfVOoM6xUQfekoMQnHApY0IU\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.railz.io:443",
        "method": "POST",
        "path": "/v1/batches",
        "body": {
            "sourceCurrency": "USD",
            "description": "Integration Test Create",
            "payments": []
        },
        "status": 200,
        "response": {
            "ok": true,
            "batch": {
                "id": "B-Dfz9qQuygxeCkwiYjbfLAS",
                "status": "open",
                "tags": [],
                "amount": "0.00",
                "currency": "USD",
                "totalPayments": 0,
                "description": "Integration Test Create",
                "sentAt": null,
                "completedAt": null,
                "createdAt": "2022-10-26T03:32:51.504Z",
                "updatedAt": "2022-10-26T03:32:51.518Z",
                "quoteExpiredAt": null,
                "payments": {
                    "payments": [],
                    "meta": {
                        "page": 1,
                        "pages": 0,
                        "records": 0
                    }
                }
            }
        },
        "rawHeaders": [
            "Date",
            "Wed, 26 Oct 2022 03:32:51 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "518",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "73",
            "X-Rate-Limit-Reset",
            "1666755231",
            "Vary",
            "Origin",
            "ETag",
            "W/\"206-svqp9HMGBAJ/oOmjlfYAZC9ZSF0\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.railz.io:443",
        "method": "POST",
        "path": "/v1/batches/B-Dfz9qQuygxeCkwiYjbfLAS/payments",
        "body": {
            "recipient": {
                "id": "R-PoY7FWr6yeyEY1635E47HL"
            },
            "externalId": "testPayment",
            "amount": "10.00",
            "currency": "USD"
        },
        "status": 200,
        "response": {
            "ok": true,
            "payment": {
                "id": "P-A4bbYMh2np7CY9h1Zaxbrh",
                "recipient": {
                    "id": "R-PoY7FWr6yeyEY1635E47HL",
                    "referenceId": "R-PoY7FWr6yeyEY1635E47HL",
                    "parentRecipientId": null,
                    "email": "testEmail@example.com",
                    "name": "Tom Jones",
                    "lastName": "Jones",
                    "firstName": "Tom",
                    "legalName": "",
                    "type": "individual",
                    "status": "incomplete",
                    "language": "en",
                    "complianceStatus": "pending",
                    "dob": null,
                    "passport": "",
                    "placeOfBirth": null,
                    "updatedAt": "2022-10-26T03:32:51.177Z",
                    "createdAt": "2022-10-26T03:32:51.177Z",
                    "tags": [],
                    "isPortalUser": false,
                    "taxDeliveryType": "mail",
                    "contactEmails": [],
                    "occupation": "",
                    "address": {
                        "street1": "123 Wolfstrasse",
                        "street2": "",
                        "city": "Berlin",
                        "postalCode": "123123",
                        "country": "DE",
                        "region": null,
                        "phone": "",
                        "phoneValidated": false
                    },
                    "compliance": {
                        "status": "pending",
                        "checkedAt": null
                    },
                    "gravatarUrl": "https://www.gravatar.com/avatar/47891e3b30e9fe3c5355801d4cbd5896?d=404",
                    "governmentId": null,
                    "ssn": null,
                    "governmentIds": [],
                    "birthplace": {
                        "country": null,
                        "region": null,
                        "city": null
                    },
                    "citizenships": [],
                    "routeType": "sepa",
                    "routeMinimum": "0",
                    "estimatedFees": "4",
                    "accounts": [],
                    "payoutMethod": null,
                    "primaryCurrency": null,
                    "riskScore": null,
                    "merchantId": "M-W3mQuLjDafUGietRUqmeRz",
                    "inactiveReasons": {
                        "primaryAccount": "missing"
                    },
                    "taxWithholdingPercentage": null,
                    "taxForm": null,
                    "taxFormStatus": null
                },
                "status": "pending",
                "isSupplyPayment": false,
                "coverFees": false,
                "returnedAmount": "0.00",
                "category": "services",
                "amount": "10.00",
                "currency": "USD",
                "sourceAmount": "10.00",
                "sourceCurrency": "USD",
                "targetAmount": "0.00",
                "targetCurrency": "USD",
                "taxReportable": true,
                "taxBasisAmount": "10.00",
                "taxBasisCurrency": "USD",
                "withholdingAmount": "0.00",
                "withholdingCurrency": "USD",
                "equivalentWithholdingAmount": "0.00",
                "equivalentWithholdingCurrency": "USD",
                "exchangeRate": "0",
                "fees": "0.00",
                "recipientFees": "0.00",
                "fxRate": "2",
                "memo": "",
                "externalId": "testPayment",
                "processedAt": null,
                "createdAt": "2022-10-26T03:32:51.937Z",
                "updatedAt": "2022-10-26T03:32:51.937Z",
                "forceUsTaxActivity": false,
                "batch": {
                    "id": "B-Dfz9qQuygxeCkwiYjbfLAS",
                    "status": "open",
                    "tags": [],
                    "amount": "10.00",
                    "currency": "USD",
                    "totalPayments": 1,
                    "description": "Integration Test Create",
                    "sentAt": null,
                    "completedAt": null,
                    "createdAt": "2022-10-26T03:32:51.504Z",
                    "updatedAt": "2022-10-26T03:32:52.013Z",
                    "quoteExpiredAt": null
                },
                "checkNumber": null,
                "tags": [],
                "merchantFees": "0.00",
                "compliance": {
                    "status": "pending",
                    "checkedAt": null
                },
                "account": null,
                "payoutMethod": null,
                "methodDisplay": null,
                "initiatedAt": null,
                "settledAt": null,
                "returnedAt": null,
                "returnedReason": [],
                "returnedNote": null,
                "estimatedDeliveryAt": null,
                "merchantId": "M-W3mQuLjDafUGietRUqmeRz",
                "taxes": [
                    {
                        "id": "OP-Enex557h6RgMuAd88YNmFw",
                        "recipientId": "R-PoY7FWr6yeyEY1635E47HL",
                        "taxFormId": null,
                        "entered": {
                            "value": "10.00",
                            "currency": "USD"
                        },
                        "withholding": {
                            "value": "0.00",
                            "currency": "USD"
                        },
                        "equivalentWithholding": {
                            "value": "0.00",
                            "currency": "USD"
                        },
                        "amount": "10.00",
                        "currency": "USD",
                        "withholdingAmount": "0.00",
                        "withholdingCurrency": "USD",
                        "equivalentWithholdingAmount": "0.00",
                        "equivalentWithholdingCurrency": "USD",
                        "paymentId": "P-A4bbYMh2np7CY9h1Zaxbrh",
                        "externalId": null,
                        "memo": "",
                        "payoutMethod": "bank-transfer",
                        "tags": [],
                        "taxReportable": true,
                        "category": "services",
                        "processedAt": "2022-10-26T03:32:51.846Z",
                        "forceUsTaxActivity": false,
                        "taxWithholdingReason": null,
                        "equivalentUntaxedAmount": {
                            "value": "10.00",
                            "currency": "USD"
                        },
                        "modifiedSinceCreation": false,
                        "taxPaidByWithholdingAgents": "0",
                        "status": "internal",
                        "enteredAmount": {
                            "value": "10.00",
                            "currency": "USD"
                        },
                        "updatedAt": "2022-10-26T03:32:51.930Z",
                        "createdAt": "2022-10-26T03:32:51.847Z",
                        "deletedAt": null
                    }
                ],
                "errors": [
                    "recipient-not-active",
                    "incomplete"
                ],
                "routeMinimum": null
            }
        },
        "rawHeaders": [
            "Date",
            "Wed, 26 Oct 2022 03:32:52 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "5005",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "72",
            "X-Rate-Limit-Reset",
            "1666755231",
            "Vary",
            "Origin",
            "ETag",
            "W/\"138d-UxB/tljmtZsaSJbn56hdEYWeLJg\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.railz.io:443",
        "method": "GET",
        "path": "/v1/payments?recipientId=R-PoY7FWr6yeyEY1635E47HL&batchId=B-Dfz9qQuygxeCkwiYjbfLAS&page=1&pageSize=10&search=",
        "body": "",
        "status": 200,
        "response": {
            "ok": true,
            "payments": [
                {
                    "id": "P-A4bbYMh2np7CY9h1Zaxbrh",
                    "recipient": {
                        "id": "R-PoY7FWr6yeyEY1635E47HL",
                        "referenceId": "R-PoY7FWr6yeyEY1635E47HL",
                        "parentRecipientId": null,
                        "email": "testEmail@example.com",
                        "name": "Tom Jones",
                        "lastName": "Jones",
                        "firstName": "Tom",
                        "legalName": "",
                        "type": "individual",
                        "status": "incomplete",
                        "language": "en",
                        "complianceStatus": "pending",
                        "dob": null,
                        "passport": "",
                        "placeOfBirth": null,
                        "updatedAt": "2022-10-26T03:32:51.177Z",
                        "createdAt": "2022-10-26T03:32:51.177Z",
                        "tags": [],
                        "isPortalUser": false,
                        "taxDeliveryType": "mail",
                        "contactEmails": [],
                        "occupation": "",
                        "address": {
                            "street1": "123 Wolfstrasse",
                            "street2": "",
                            "city": "Berlin",
                            "postalCode": "123123",
                            "country": "DE",
                            "region": null,
                            "phone": "",
                            "phoneValidated": false
                        },
                        "compliance": {
                            "status": "pending",
                            "checkedAt": null
                        },
                        "gravatarUrl": "https://www.gravatar.com/avatar/47891e3b30e9fe3c5355801d4cbd5896?d=404",
                        "governmentId": null,
                        "ssn": null,
                        "governmentIds": [],
                        "birthplace": {
                            "country": null,
                            "region": null,
                            "city": null
                        },
                        "citizenships": [],
                        "routeType": "sepa",
                        "routeMinimum": "0",
                        "estimatedFees": "4",
                        "accounts": [],
                        "payoutMethod": null,
                        "primaryCurrency": null,
                        "riskScore": null,
                        "merchantId": "M-W3mQuLjDafUGietRUqmeRz",
                        "inactiveReasons": {
                            "primaryAccount": "missing"
                        },
                        "taxWithholdingPercentage": null,
                        "taxForm": null,
                        "taxFormStatus": null
                    },
                    "status": "pending",
                    "isSupplyPayment": false,
                    "coverFees": false,
                    "returnedAmount": "0.00",
                    "category": "services",
                    "amount": "10.00",
                    "currency": "USD",
                    "sourceAmount": "10.00",
                    "sourceCurrency": "USD",
                    "targetAmount": "0.00",
                    "targetCurrency": "USD",
                    "taxReportable": true,
                    "taxBasisAmount": "10.00",
                    "taxBasisCurrency": "USD",
                    "withholdingAmount": "0.00",
                    "withholdingCurrency": "USD",
                    "equivalentWithholdingAmount": "0.00",
                    "equivalentWithholdingCurrency": "USD",
                    "exchangeRate": "0",
                    "fees": "0.00",
                    "recipientFees": "0.00",
                    "fxRate": "2",
                    "memo": "",
                    "externalId": "testPayment",
                    "processedAt": null,
                    "createdAt": "2022-10-26T03:32:51.937Z",
                    "updatedAt": "2022-10-26T03:32:51.937Z",
                    "forceUsTaxActivity": false,
                    "batch": {
                        "id": "B-Dfz9qQuygxeCkwiYjbfLAS",
                        "status": "open",
                        "tags": [],
                        "amount": "10.00",
                        "currency": "USD",
                        "totalPayments": 1,
                        "description": "Integration Test Create",
                        "sentAt": null,
                        "completedAt": null,
                        "createdAt": "2022-10-26T03:32:51.504Z",
                        "updatedAt": "2022-10-26T03:32:52.013Z",
                        "quoteExpiredAt": null
                    },
                    "checkNumber": null,
                    "tags": [],
                    "merchantFees": "0.00",
                    "compliance": {
                        "status": "pending",
                        "checkedAt": null
                    },
                    "account": null,
                    "payoutMethod": null,
                    "methodDisplay": null,
                    "initiatedAt": null,
                    "settledAt": null,
                    "returnedAt": null,
                    "returnedReason": [],
                    "returnedNote": null,
                    "estimatedDeliveryAt": null,
                    "merchantId": "M-W3mQuLjDafUGietRUqmeRz",
                    "taxes": [
                        {
                            "id": "OP-Enex557h6RgMuAd88YNmFw",
                            "recipientId": "R-PoY7FWr6yeyEY1635E47HL",
                            "taxFormId": null,
                            "entered": {
                                "value": "10.00",
                                "currency": "USD"
                            },
                            "withholding": {
                                "value": "0.00",
                                "currency": "USD"
                            },
                            "equivalentWithholding": {
                                "value": "0.00",
                                "currency": "USD"
                            },
                            "amount": "10.00",
                            "currency": "USD",
                            "withholdingAmount": "0.00",
                            "withholdingCurrency": "USD",
                            "equivalentWithholdingAmount": "0.00",
                            "equivalentWithholdingCurrency": "USD",
                            "paymentId": "P-A4bbYMh2np7CY9h1Zaxbrh",
                            "externalId": null,
                            "memo": "",
                            "payoutMethod": "bank-transfer",
                            "tags": [],
                            "taxReportable": true,
                            "category": "services",
                            "processedAt": "2022-10-26T03:32:51.846Z",
                            "forceUsTaxActivity": false,
                            "taxWithholdingReason": null,
                            "equivalentUntaxedAmount": {
                                "value": "10.00",
                                "currency": "USD"
                            },
                            "modifiedSinceCreation": false,
                            "taxPaidByWithholdingAgents": "0",
                            "status": "internal",
                            "enteredAmount": {
                                "value": "10.00",
                                "currency": "USD"
                            },
                            "updatedAt": "2022-10-26T03:32:51.930Z",
                            "createdAt": "2022-10-26T03:32:51.847Z",
                            "deletedAt": null
                        }
                    ],
                    "errors": [
                        "recipient-not-active",
                        "incomplete"
                    ],
                    "routeMinimum": null
                }
            ],
            "meta": {
                "page": 1,
                "pages": 1,
                "records": 1
            }
        },
        "rawHeaders": [
            "Date",
            "Wed, 26 Oct 2022 03:32:53 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "5435",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "71",
            "X-Rate-Limit-Reset",
            "1666755231",
            "Vary",
            "Origin",
            "ETag",
            "W/\"153b-5w9d+zNUoRkt6Nhk4EiOWOPPdWo\""
        ],
        "responseIsBinary": false
    }
]